-- -------------------------------------
-- MySQL Export
-- Database: 配置库
-- Time: 2026-03-09 14:34:11
-- -------------------------------------
SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for `hha封头成形厚度减薄率表`
-- ----------------------------
DROP TABLE IF EXISTS `hha封头成形厚度减薄率表`;
CREATE TABLE `hha封头成形厚度减薄率表` (
  `公称直径DN1` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `公称直径DN2` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `给定的名义厚度1` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `给定的名义厚度2` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `成形方法` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `厚度减薄率` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `ID` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`ID`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of `hha封头成形厚度减薄率表`
-- ----------------------------
INSERT INTO `hha封头成形厚度减薄率表` (`公称直径DN1`, `公称直径DN2`, `给定的名义厚度1`, `给定的名义厚度2`, `成形方法`, `厚度减薄率`, `ID`) VALUES
('≤', '< ', '≤', '< ', '成形方法', '%', 39),
('150', '300', '3', '8', '冷冲压法', '15', 40),
('150', '300', '8', '12', '冷冲压法', '15', 41),
('150', '300', '12', NULL, '热冲压法', '15', 42),
('300', '600', '6', '8', '冷冲压法', '15', 43),
('300', '600', '8', '12', '冷冲压法', '15', 44),
('300', '600', '12', '18', '冷冲压法', '15', 45),
('300', '600', '18', NULL, '热冲压法', '15', 46),
('600', '1000', '6', '8', '冷冲压法', '15', 47),
('600', '1000', '8', '12', '冷冲压法', '15', 48),
('600', '1000', '12', '26', '热冲压法', '15', 49),
('600', '1000', '26', NULL, '热冲压法', '15', 50),
('1000', '1800', '6', '8', '冷冲压法', '15', 51),
('1000', '1800', '8', '14', '冷冲压法', '15', 52),
('1000', '1800', '14', '26', '热冲压法', '15', 53),
('1000', '1800', '26', NULL, '热冲压法', '15', 54),
('1800', '2600', '6', '8', '冷冲压法', '15', 55),
('1800', '2600', '8', '14', '冷旋压法', '15', 56),
('1800', '2600', '14', '26', '冷旋压法', '15', 57),
('1800', '2600', '26', NULL, '热冲压法', '15', 58),
('2600', '3200', '8', '10', '冷旋压法', '15', 59),
('2600', '3200', '10', '16', '冷旋压法', '15', 60),
('2600', '3200', '16', '26', '热冲压法', '15', 61),
('2600', '3200', '26', '36', '热冲压法', '15', 62),
('2600', '3200', '36', NULL, '热冲压法', '15', 63),
('3200', '4200', '10', '16', '冷旋压法', '15', 64),
('3200', '4200', '16', '26', '冷旋压法', '15', 65),
('3200', '4200', '26', '36', '冷旋压法', '15', 66),
('3200', '4200', '36', NULL, '热旋压法', '15', 67),
('4200', '6000', '12', '16', '冷旋压法', '15', 68),
('4200', '6000', '16', '26', '冷旋压法', '15', 69),
('4200', '6000', '26', '36', '冷旋压法', '15', 70),
('4200', '6000', '36', NULL, '热冲压法', '15', 71),
('6000', '8000', '14', '24', '分割法', '0', 72),
('6000', '8000', '24', '36', '分割法', '0', 73),
('6000', '8000', '36', NULL, '分割法', '0', 74),
('8000', '10000', '16', '36', '分割法', '0', 75),
('8000', '10000', '30', NULL, '分割法', '0', 76);

SET FOREIGN_KEY_CHECKS = 1;
